START_MESSAGE_RU = """Привет, {0}!👋 Я бот погоды!🌞
Чтобы узнать погоду в твоем городе, нажми кнопку <i>"Узнать погоду"</i> и разреши доступ к твоим геоданным!"""

LOADING_MESSAGE_RU = """Загрузка ⏳"""

DATA_MESSAGE_RU = """Готово! ✅
Код вашей страны: <b>{0}</b> 
Город (район): <b>{1}</b> 

📅 Дата <u>{2}</u>

☀ Восход  <u>{3}</u>
🌑 Закат  <u>{4}</u>
 
Погода на данный момент: 
<b>{5}</b>  
🌡 Температура <b>{6}°C</b>  
💧 Влажность воздуха <b>{7}%</b> 
💨 Скорость ветра <b>{8} м/с</b> 

Прогноз через <b>5 часов</b>:
<b>{9}</b> 
🌡 Температура <b>{10}°C</b> 
💧 Влажность воздуха <b>{11}%</b>  
💨 Скорость ветра <b>{12} м/с</b> 

Прогноз на <b>завтра</b>: 
<b>{13}</b>  
🌡 Температура <b>{14}°C</b> 
💧 Влажность воздуха <b>{15}%</b> 
💨 Скорость ветра <b>{16}м/с</b> """

ERROR_MESSAGE_RU = """Ошибка❌
Пожалуйста, попробуйте позже"""

CHANGE_LANGUAGE = """Выберите язык (RU)
Абярыце мову (BY)"""

CHOSEN_RU = """Вы выбрали русский язык
Теперь нажмите "Узнать погоду" """

CHOSEN_BY ="""Вы выбралі беларускую мову
Цяпер націсніце "Даведацца надвор'е" """

HELP_MESSAGE = """/start
/help
/language /lang /l"""