START_MESSAGE_RU = """<b>Привет, {0}!</b>👋 

Я бот погоды! 🌨️
Чтобы узнать погоду, нажми кнопку <i>"Узнать погоду"</i> и разреши доступ к твоим геоданным!

/help - навигация по командам"""

LOADING_MESSAGE_RU = """Загрузка ⏳
Это может занять некоторое время."""

LOADING_MESSAGE_BY = """Загрузка ⏳
Гэта можа заняць некаторы час."""

DATA_MESSAGE_RU = """Готово! ✅
Код вашей страны: <b>{0}</b> 
Город (район): <b>{1}</b> 

📅 Дата: <b>{2}</b>

🌅 Восход:  <b>{3}</b>
🌇 ЗакатL  <b>{4}</b>
 
Погода сейчас: 
<b>{5}</b>  
🌡 Температура <b>{6}°C</b>  
💧 Влажность воздуха <b>{7}%</b> 
💨 Скорость ветра <b>{8} м/с</b> 

Прогноз через 5 часов:
<b>{9}</b> 
🌡 Температура <b>{10}°C</b> 
💧 Влажность воздуха <b>{11}%</b>  
💨 Скорость ветра <b>{12} м/с</b> 

Прогноз на завтра: 
<b>{13}</b>  
🌡 Температура <b>{14}°C</b> 
💧 Влажность воздуха <b>{15}%</b> 
💨 Скорость ветра <b>{16}м/с</b> """

DATA_MESSAGE_BY ="""Гатова! ✅
Код вашай краіны: <b>{0}</b>
Горад (раён): <b>{1}</b>

📅 Дата: <b>{2}</b>

🌅 Узыход: <b>{3}</b>
🌇 Закат: <b>{4}</b>

Надвор'е зараз:
<b>{5}</b>
🌡 Тэмпература <b>{6}</b>°C
💧 Вільготнасць паветра <b>{7}</b>%
💨 Хуткасць ветру <b>{8}</b>м/c

Прагноз праз 5 гадзін:
<b>{9}</b>
🌡 Тэмпература <b>{10}</b>°C
💧 Вільготнасць паветра <b>{11}</b>%
💨 Хуткасць ветру <b>{12}</b>м/c

Прагноз на заўтра:
<b>{13}</b>
🌡 Тэмпература <b>{14}</b>°C
💧 Вільготнасць паветра <b>{15}</b>%
💨 Хуткасць ветру <b>{16}</b>м/c"""

ERROR_MESSAGE_RU = """Ошибка❌
Пожалуйста, попробуйте позже"""

CHANGE_LANGUAGE = """Выберите язык (RU)
Абярыце мову (BY)"""

CHOSEN_RU = """Вы выбрали русский язык
Теперь нажмите "Узнать погоду" """

CHOSEN_BY ="""Вы выбралі беларускую мову
Цяпер націсніце "Даведацца надвор'е" """

HELP_MESSAGE = """<strong>Available commands:</strong>
<i>/start</i>
<i>/help</i>
<i>/language</i>"""